# ParameterFilterRuleFactory Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterFilterRuleFactory Class
Members See Also
---
Contains functions that create appropriate FilterRule objects based on the parameters given.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class ParameterFilterRuleFactory : IDisposable
```

Visual Basic
---
```text
Public Class ParameterFilterRuleFactory _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ParameterFilterRuleFactory : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ParameterFilterRuleFactory
# See Also
ParameterFilterRuleFactory Members
Autodesk.Revit.DB Namespace